using UnityEngine;

namespace Weight
{
    /*=======================================
    重さの順番を定義します
    WT_NO_WEIGHT ：重さ無し
    WT_PLAYER    ：プレイヤ(最軽)
    WT_FRAGMENT  ：カケラを同一視する場合の項目
    WT_FR_SAND   ：砂(岩)のカケラ
    WT_OUTSD_SAND：外砂(カケラを同一視する場合は最重)
    WT_FR_RUINS  ：遺跡のカケラ(最重)

    重さの順番
    パターン１(カケラを同一視する場合)
    外砂＝カケラ＞プレイヤ

    パターン２(カケラを２種類に分けて扱う場合)
    遺跡のカケラ＞外砂＝砂(岩)のカケラ＞プレイヤ
    =========================================*/
    public enum WEIGHT
    {
        //↑軽い
        WT_NO_WEIGHT = 0,
        WT_PLAYER,
        WT_FRAGMENT,
        WT_FR_SAND = 2,
        WT_OUTSD_SAND = 2,
        WT_FR_RUINS,
        //↓重い
    };

    /*=======================================
    比較関数を使った時の結果

    CR_ONE　：引数１が大きい
    CR_TWO　：引数２が大きい
    CR_EQUAL：引数１と引数２が同じ
    =========================================*/
    public enum COM_RESULT
    {
        CR_ONE = 0,
        CR_TWO,
        CR_EQUAL,
    };

    /*=======================================
    比較する関数

    比較するものを引数１と引数２に入れたら
    COM_RESULTで結果を返します

    一応ここに作っとくけど
    正直シーソーのとこに作った方が良い気がしています
    =========================================*/
}
